zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/system_stm32mp2xx_a35.c
/**
  ******************************************************************************
  * @file    system_stm32mp2xx_a35.c
  * @author  C.ICORD (Intropack Team)
  * @version $VERSION$
  * @date    $DATE$
  * @brief   CMSIS Cortex-A35 Device Peripheral Access Layer System Source File
  *
  *   This file provides one global variable and two functions to be used/called
  *   by user application:
  *
  *      - SystemInit(): Called at start-up just after reset before branching
  *                      to main program.
  *
  *      - SystemCoreClock variable: Manages the core clock frequency
  *
  *      - SystemCoreClockUpdate(): Updates the variable SystemCoreClock and must
  *                                 be called whenever the core clock is changed
  *                                 during program execution.
  *
  *   After each device reset, HSI clock is used as system clock source.
  *   Then, SystemInit() function is called, in "startup_stm32mp2xx_a35.c" file,
  *   to configure the system clock before branching to main program.
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2022 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup STM32MP2xx_system
  * @{
  */

/** @addtogroup STM32MP2xx_System_Private_Includes
  * @{
  */
//#define DEBUG_TIMER
//#define DEBUG_IRQ_ERROR
//#define DEBUG_PPI2x

#include <stdint.h>
#if defined(DEBUG_IRQ_ERROR) || defined(DEBUG_PPI2x)
#include <stdio.h>
#endif
#include "stm32mp2xx_hal.h"
#include "irq_ctrl.h"
#include "system_stm32mp2xx.h"
#include "system_stm32mp2xx_a35_utils.h"

/**
  * @}
  */

/** @addtogroup STM32MP2xx_System_Private_TypesDefinitions
  * @{
  */
#if defined(CR_CMSIS_IT_GROUP_MANAGEMENT) || defined(WA_CMSIS_ISSUE_IRQ_GETACTIVE)
typedef struct interrupt_infos
{
   uint16_t id;
   uint8_t  requested_cpu_id;
   uint8_t  group;
} interrupt_infos_t;
#endif /* defined(CR_CMSIS_IT_GROUP_MANAGEMENT) || defined(WA_CMSIS_ISSUE_IRQ_GETACTIVE) */

/**
  * @}
  */

/** @addtogroup STM32MP2xx_System_Private_Defines
  * @{
  */
/* These defines are associated to GIC400 */
#define GIC_HIGHEST_INTERRUPT_VALUE 1020
#define GIC_HIGHEST_SGI_PPI_VALUE     31
#define GIC_HIGHEST_SGI_VALUE         15
/*
 * ID 1023. This value is returned to a processor,
 * in response to an interrupt acknowledge,
 * if there is no pending interrupt with sufficient priority
 * for it to be signalized to the processor.
 */
#define GIC_ACKNOWLEDGE_RESPONSE 1023

#if defined(CR_CMSIS_IT_GROUP_MANAGEMENT) || defined(WA_CMSIS_ISSUE_IRQ_GETACTIVE)
#define MAX_LIMIT_VALID_IT_ID 1022
#define INVALID_IT_ID 0xFFFF
#endif /* defined(CR_CMSIS_IT_GROUP_MANAGEMENT) || defined(WA_CMSIS_ISSUE_IRQ_GETACTIVE) */

/* IRQ Handling error values */
#define NO_IRQ_ERROR                 0x00000000UL
#define ERROR_IRQ_IDX_OUT_OF_RANGE   0x00BAD11DUL
#define ERROR_UNDEFINED_IRQ_HANDLER  0xDEAD11F0UL
#define ERROR_SPURIOUS_IRQ           0xFFFF1022UL

/************************* Miscellaneous Configuration ************************/
/*!< Uncomment the following line if you need to relocate your vector Table in
     Internal SRAM. */
/* #define VECT_TAB_SRAM */
#define VECT_TAB_OFFSET  0x00 /*!< Vector Table base offset field.
                                   This value must be a multiple of 0x200. */
/******************************************************************************/
/**
  * @}
  */

/** @addtogroup STM32MP2xx_System_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @addtogroup STM32MP2xx_System_Private_Variables
  * @{
  */

uint32_t IRQHandlingError = NO_IRQ_ERROR;
uint32_t TimerPeriod = 0;
uint32_t A35SysTick_TimerSource = A35_SYSTICK_PHYSICALTIMERSOURCE;
#ifdef DEBUG_TIMER
uint32_t RELOAD_VAL = 0;
#endif
#ifdef DEBUG_TIMER2
uint32_t RELOAD_VAL2 = 0;
#endif
#ifdef DEBUG_PPI2x
uint32_t FIQ_count = 0;
uint32_t IRQ_count = 0;
uint32_t PPI27_count = 0;
uint32_t PPI29_count = 0;
uint32_t PPI30_count = 0;
#endif

/*----------------------------------------------------------------------------
  System Core Clock Variable
 *----------------------------------------------------------------------------*/
/* The SystemCoreClock variable is updated in two ways:
    1) by calling CMSIS function SystemCoreClockUpdate()
    2) each time HAL_RCCEx_CA35SS_SetCA35SSClockSource() is called to configure
         the CA35 clock frequency
       Note: If you use this function to configure the system clock frequency
             then there is no need to call SystemCoreClockUpdate(), since
             SystemCoreClock variable is updated automatically.
*/
uint32_t SystemCoreClock = HSI_VALUE;

uint32_t Processing_IRQ_flag = 0xDEADBEEF;
uint32_t IRQ_current_index = 0;
uint32_t Processing_FIQ_flag = 0xDEADBEEF;
uint32_t FIQ_current_index = 0;
uint32_t Spurious_IT_count = 0;

