zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/system_stm32mp2xx_a35.c
#if defined(CR_CMSIS_IT_GROUP_MANAGEMENT) || defined(WA_CMSIS_ISSUE_IRQ_GETACTIVE)
static interrupt_infos_t current_interrupt_infos[A35_NB_CORES];
#endif /* defined(CR_CMSIS_IT_GROUP_MANAGEMENT) || defined(WA_CMSIS_ISSUE_IRQ_GETACTIVE) */

/**
  * @}
  */

/** @addtogroup STM32MP2xx_System_Private_FunctionPrototypes
  * @{
  */
#ifdef WA_CMSIS_ISSUE_IRQ_SETMODE
int32_t FIX_SetModeIssueOnInterruptGroup( IRQn_ID_t irqn,
                                          uint32_t  mode);
#endif /* WA_CMSIS_ISSUE_IRQ_SETMODE */
#ifdef CR_CMSIS_IT_GROUP_MANAGEMENT
interrupt_infos_t newIRQ_GetActiveInterrupt( void );
int32_t newIRQ_EndOfInterrupt( interrupt_infos_t current_interrupt_infos );
#endif /* CR_CMSIS_IT_GROUP_MANAGEMENT */
#ifdef WA_CMSIS_ISSUE_IRQ_GETACTIVE
interrupt_infos_t FIX_IRQ_GetActiveInterrupt( void );
int32_t newIRQ_EndOfInterrupt( interrupt_infos_t current_interrupt_infos );
#endif /* WA_CMSIS_ISSUE_IRQ_GETACTIVE */

/**
  * @}
  */

/** @addtogroup STM32MP2xx_System_Private_Functions
  * @{
  */
#ifdef WA_CMSIS_ISSUE_IRQ_SETMODE
int32_t FIX_SetModeIssueOnInterruptGroup( IRQn_ID_t irqn,
                                          uint32_t  mode)
{
  uint32_t val;
  uint8_t group;
  int32_t status = 0;

  // Check interrupt domain
  val = mode & IRQ_MODE_DOMAIN_Msk;

  // Check security extensions support
  if ( (GIC_DistributorInfo() & (1UL << 10U)) != 0U)
  {
     if (val == IRQ_MODE_DOMAIN_NONSECURE)
     {
        group = 1U;
     }
     else
     {
        group = 0U;
     }
  }
  else
  {
     if (val == IRQ_MODE_DOMAIN_NONSECURE)
     {
        group = 0U;
     }
     else
     {
        status = -1;
     }
  }
  if (status == 0)
  {
     GIC_SetGroup((IRQn_Type)irqn, group);
  }
  return status;
}
#endif /* WA_CMSIS_ISSUE_IRQ_SETMODE */

#ifdef CR_CMSIS_IT_GROUP_MANAGEMENT
interrupt_infos_t newIRQ_GetActiveInterrupt( void )
{
  interrupt_infos_t current_it = {INVALID_IT_ID, 0xFF, 0xFF};
  uint32_t gicc_regval;
  uint32_t pending_G0 = 0, pending_G1 = 0;

  /* Read index of pending interrupt with the highest priority in "Group0" */
  gicc_regval = GIC_GetHighPendingIRQ();
  pending_G0 = gicc_regval & 0x3FF;
  if (pending_G0 < MAX_LIMIT_VALID_IT_ID)
  {
     /* Acknowledge pending "Group0" interrupt (make it active)   */
     /* by getting GICC_IAR value (see #4.4.4 in [ARM IHI 0048B]) */
     /* NB : GIC_AcknowledgePending() from "CMSIS Core_A" v5.5.1  */
     /*      is not sufficient to manage GICC_IAR specifications  */
     /*      ("CPUID" field in SGI case).                         */
     gicc_regval = GICInterface->IAR;
     current_it.group = 0;
     current_it.requested_cpu_id = (uint8_t)((gicc_regval >> 10) & 0x7);
     current_it.id = (uint16_t)(gicc_regval & 0x3FF);
  }
  /* Check whether a "Group 1" interrupt is pending */
  else
  {
     gicc_regval = GICInterface->AHPPIR;
     pending_G1 = gicc_regval & 0x3FF;
     if (pending_G1 < MAX_LIMIT_VALID_IT_ID)
     {
        /* Acknowledge "Group1" pending interrupt (make it active)    */
        /* by getting GICC_AIAR value (see #4.4.4 in [ARM IHI 0048B]) */
        /* NB : This function doesn't exist in "CMSIS Core_A" v5.5.1  */
        gicc_regval = GICInterface->AIAR;
        current_it.group = 1;
        current_it.requested_cpu_id = (uint8_t)((gicc_regval >> 10) & 0x7);
        current_it.id = (uint16_t)(gicc_regval & 0x3FF);
     }
     else
        current_it.id = (uint16_t)(pending_G0 | pending_G1);
  }
  return current_it;
}

int32_t newIRQ_EndOfInterrupt( interrupt_infos_t current_interrupt_infos )
{
  int32_t status = -1;
  volatile uint32_t gicc_regval;

  /* Process end of acknowledged interrupt by writing values read        */
  /* in GICC_IAR resp. GICC_AIAR register according to interrupt Group : */
  /* - by setting "Interrupt ID" bits [9:0] */
  gicc_regval = (uint32_t)current_interrupt_infos.id;
  if ( gicc_regval < MAX_LIMIT_VALID_IT_ID )
  {
  /* - by setting "CPUID" bits [12:10] */
     gicc_regval |= (uint32_t)(current_interrupt_infos.requested_cpu_id << 10);
  /* ["Group 0" IT case] */
  /* - by writing value in GICC_EOIR "End of Interrupt Register" */
  /*   (see 4.4.5 (Table 4-36) in [ARM IHI 0048B])               */
     if (0 == current_interrupt_infos.group)
     {
       GICInterface->EOIR = gicc_regval;
       status = 0;
     }
  /* ["Group 1" IT case] */
  /* - by writing value in "Aliased End of Interrupt Register" */
  /*   (see 4.4.10 (Table 4-45) in [ARM IHI 0048B])            */
     else if (1 == current_interrupt_infos.group)
     {
       GICInterface->AEOIR = gicc_regval;
       status = 0;
     }
  }
  return status;
}
#endif /* CR_CMSIS_IT_GROUP_MANAGEMENT */

#ifdef WA_CMSIS_ISSUE_IRQ_GETACTIVE
interrupt_infos_t FIX_IRQ_GetActiveInterrupt( void )
{
  interrupt_infos_t current_it = {INVALID_IT_ID, 0xFF, 0xFF};
  uint32_t gicc_regval, pending_G1 = 0;

  /* Read index of pending interrupt with the highest priority in "Group1" */
  gicc_regval = GIC_GetHighPendingIRQ();
  pending_G1 = gicc_regval & 0x3FF;

  if (pending_G1 < MAX_LIMIT_VALID_IT_ID)
  {
     /* Acknowledge "Group1" pending interrupt (make it active)   */
     /* by getting GICC_IAR value (see #4.4.4 in [ARM IHI 0048B]) */
     /* NB : GIC_AcknowledgePending() from "CMSIS Core_A" v5.5.1  */
     /*      is not sufficient to manage GICC_IAR specifications  */
     /*      ("CPUID" field in SGI case).                         */
     gicc_regval = GICInterface->IAR;
     current_it.group = 1;
     current_it.requested_cpu_id = (uint8_t)((gicc_regval >> 10) & 0x7);
     current_it.id = (uint16_t)(gicc_regval & 0x3FF);
  }
  else
     current_it.id = (uint16_t)pending_G1;
  return current_it;
}

int32_t newIRQ_EndOfInterrupt( interrupt_infos_t current_interrupt_infos )
{
  int32_t status = -1;
  volatile uint32_t gicc_regval;

  /* Process end of acknowledged interrupt by writing values */
  /* read in GICC_IAR register : */
  /* - by setting "Interrupt ID" bits [9:0] */
  gicc_regval = (uint32_t)current_interrupt_infos.id;
  if ( gicc_regval < MAX_LIMIT_VALID_IT_ID )
  {
  /* - by setting "CPUID" bits [12:10] */
     gicc_regval |= (uint32_t)(current_interrupt_infos.requested_cpu_id << 10);
  /* ["Group 1" IT case] */
  /* - by writing value in GICC_EOIR "End of Interrupt Register" */
  /*   (see 4.4.5 (Table 4-36) in [ARM IHI 0048B])               */
     GICInterface->EOIR = gicc_regval;
     status = 0;
  }
  return status;
}
#endif /* WA_CMSIS_ISSUE_IRQ_GETACTIVE */

/**
  * @brief  Generic IRQ Error Handler
  * @param  None
  * @retval None
  */
static void SystemInit_IRQ_ErrorHandler(void)
{
  /* Loop indefinitely in case of IRQ handling Errors */
  //while(1);
  Spurious_IT_count += 1;
  if (Spurious_IT_count > 1000)
  {
#ifdef DEBUG_IRQ_ERROR
     printf("<E> TWO MANY SPURIOUS INTERRUPTS OCCURRED\n");
#endif /* DEBUG_IRQ_ERROR */
     while(1);
  }
}

/**
  * @brief  Generic IRQ Handler for (non-secure) SGI, PPI & SPI interrupts
  *         routed on IRQ line from GIC400 to CPU
  * @param  None
  * @retval None
  */
void __attribute__ ((interrupt ("IRQ")))IRQ_Handler(void)
{
  IRQHandler_t handler;
  uint32_t ItId;
#if defined(CR_CMSIS_IT_GROUP_MANAGEMENT) || defined(WA_CMSIS_ISSUE_IRQ_GETACTIVE)
  uint32_t core_idx;
#endif /* defined(CR_CMSIS_IT_GROUP_MANAGEMENT) || defined(WA_CMSIS_ISSUE_IRQ_GETACTIVE) */

