zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/system_stm32mp2xx_a35.c
  /* Process all pending IRQ interrupts */
  Processing_IRQ_flag = 1;
  while (1)
  {
#if defined(CR_CMSIS_IT_GROUP_MANAGEMENT) || defined(WA_CMSIS_ISSUE_IRQ_GETACTIVE)
    /* Get core index by reading MPIDR bits [3:0] */
    __asm volatile("MRC p15, 0, %0, c0, c0, 5"   :"=r" (core_idx) : /* no input regs */ : /* no clobbered regs */);
    core_idx = core_idx & 0xF;

    /* Get current pending interrupt infos */
    #ifdef CR_CMSIS_IT_GROUP_MANAGEMENT
    current_interrupt_infos[core_idx] = newIRQ_GetActiveInterrupt();
    #else
    current_interrupt_infos[core_idx] = FIX_IRQ_GetActiveInterrupt();
    #endif /* CR_CMSIS_IT_GROUP_MANAGEMENT */
    ItId = current_interrupt_infos[core_idx].id;
#else
    /* Get highest pending interrupt index from GIC driver */
    ItId = IRQ_GetActiveIRQ();
#endif /* defined(CR_CMSIS_IT_GROUP_MANAGEMENT) || defined(WA_CMSIS_ISSUE_IRQ_GETACTIVE) */
    IRQ_current_index = ItId;
    /* Check interrupt index */
    if (ItId <= GIC_HIGHEST_INTERRUPT_VALUE)
    {
      /* Check validity of interrupt index */
      if (ItId >= MAX_IRQ_n)
      {
        IRQHandlingError = ERROR_IRQ_IDX_OUT_OF_RANGE;
        SystemInit_IRQ_ErrorHandler();
      }
      else
      {
        /* Clear pending interrupt at GIC400 input,  */
        /* if it is in edge triggering mode to allow */
        /* source to send another.                   */
        if (IRQ_MODE_TRIG_EDGE == IRQ_GetMode(ItId))
        {
          IRQ_ClearPending(ItId);
        }
        /* Get and check corresponding interrupt handler */
        handler = IRQ_GetHandler(ItId);
        if (handler != (IRQHandler_t)Default_ITHandler)
        {
          /* Call IRQ Handler */
          handler();
        }
        else
        {
          /* Not configured handler case --> error ! */
          IRQHandlingError = ERROR_UNDEFINED_IRQ_HANDLER;
          SystemInit_IRQ_ErrorHandler();
        }
        /* Clear pending interrupt at GIC400 input,   */
        /* if it is in level triggering mode to allow */
        /* source to send another.                    */
        if (IRQ_MODE_TRIG_LEVEL == IRQ_GetMode(ItId))
        {
          IRQ_ClearPending(ItId);
        }
      }
      /* Complete processing of acknowledged interrupt */
#if defined(CR_CMSIS_IT_GROUP_MANAGEMENT) || defined(WA_CMSIS_ISSUE_IRQ_GETACTIVE)
      newIRQ_EndOfInterrupt(current_interrupt_infos[core_idx]);
#else
      IRQ_EndOfInterrupt(ItId);
#endif /* CR_CMSIS_IT_GROUP_MANAGEMENT */
    }
    else
    {
      /* Normal case: whenever there is no more pending interrupt, */
      /* IAR returns ACKNOWLEDGE special IRQ value */
      if (ItId == GIC_ACKNOWLEDGE_RESPONSE)
      {
        break;
      }
      /* Spurious IRQ Value (1022)  ... */
      else
      {
        IRQHandlingError = ERROR_SPURIOUS_IRQ;
        SystemInit_IRQ_ErrorHandler();
      }
    }
#ifdef DEBUG_PPI2x
    IRQ_count += 1;
#endif /* DEBUG_PPI2x */
  }
  Processing_IRQ_flag = 0;
}

/**
  * @brief  Generic FIQ Handler for (secure) SGI, PPI & SPI interrupts
  *         routed on FIQ line from GIC400 to CPU
  * @param  None
  * @retval None
  */
void __attribute__ ((interrupt ("FIQ")))FIQ_Handler(void)
{
  uint32_t ItId;
  IRQHandler_t handler;
#ifdef CR_CMSIS_IT_GROUP_MANAGEMENT
  uint32_t core_idx;
#endif /* CR_CMSIS_IT_GROUP_MANAGEMENT */

  /* Process all pending interrupts on FIQ line */
  Processing_FIQ_flag = 1;
  while (1)
  {
#ifdef CR_CMSIS_IT_GROUP_MANAGEMENT
    /* Get core index by reading MPIDR bits [3:0] */
    __asm volatile("MRC p15, 0, %0, c0, c0, 5"   :"=r" (core_idx) : /* no input regs */ : /* no clobbered regs */);
    core_idx = core_idx & 0xF;

    /* Get current pending interrupt infos */
    current_interrupt_infos[core_idx] = newIRQ_GetActiveInterrupt();
    ItId = current_interrupt_infos[core_idx].id;
#else
    /* Get highest pending interrupt index from GIC driver */
    ItId = IRQ_GetActiveIRQ();
#endif /* CR_CMSIS_IT_GROUP_MANAGEMENT */
    FIQ_current_index = ItId;

    if (ItId <= GIC_HIGHEST_INTERRUPT_VALUE) /* Highest value of GIC valid interrupt */
    {
      /* Check validity of IRQ */
      if (ItId >= MAX_IRQ_n)
      {
        IRQHandlingError = ERROR_IRQ_IDX_OUT_OF_RANGE;
        SystemInit_IRQ_ErrorHandler();
      }
      else
      {
        /* Clear pending interrupt at GIC400 input,  */
        /* if it is in edge triggering mode to allow */
        /* source to send another.                   */
        if (IRQ_MODE_TRIG_EDGE == IRQ_GetMode(ItId))
        {
          IRQ_ClearPending(ItId);
        }

        /* Get and check corresponding interrupt handler */
        handler = IRQ_GetHandler(ItId);
        if (handler != (IRQHandler_t)Default_ITHandler)
        {
          /* Call interrupt handler */
          handler();
        }
        else
        {
          /* Not configured handler case --> error ! */
          IRQHandlingError = ERROR_UNDEFINED_IRQ_HANDLER;
          SystemInit_IRQ_ErrorHandler();
        }
        /* Clear pending interrupt at GIC400 input,   */
        /* if it is in level triggering mode to allow */
        /* source to send another.                    */
        if (IRQ_MODE_TRIG_LEVEL == IRQ_GetMode(ItId))
        {
          IRQ_ClearPending(ItId);
        }
      }
      /* Complete processing of acknowledged interrupt */
#ifdef CR_CMSIS_IT_GROUP_MANAGEMENT
      newIRQ_EndOfInterrupt(current_interrupt_infos[core_idx]);
#else
      IRQ_EndOfInterrupt(ItId);
#endif /* CR_CMSIS_IT_GROUP_MANAGEMENT */
    }
    else
    {
      /* Normal case: whenever there is no more pending IRQ , IAR returns ACKNOWLEDGE special IRQ value */
      if (ItId == GIC_ACKNOWLEDGE_RESPONSE)
      {
        break;
      }
      /* Spurious IRQ Value (1022)  ... */
      else
      {
        IRQHandlingError = ERROR_SPURIOUS_IRQ;
        SystemInit_IRQ_ErrorHandler();
      }
    }
#ifdef DEBUG_PPI2x
    FIQ_count += 1;
#endif /* DEBUG_PPI2x */
  }
  Processing_FIQ_flag = 0;
}

/**
  * @brief  Ensure all BSS part of code is initialized with zeros
  * @param  None
  * @retval None
  */
void __attribute__((noinline)) ZeroBss(void)
{
    __asm volatile(
      "PUSH {R4-R11}          \n"
      "LDR r2, =ZI_DATA       \n"
      "b LoopFillZerobss      \n"
      /* Zero fill the bss segment. */
      "FillZerobss:           \n"
      "MOVS r3, #0            \n"
      "STR  r3, [r2]          \n"
      "adds r2, r2, #4        \n"

      "LoopFillZerobss:       \n"
      "LDR r3, = __BSS_END__  \n"
      "CMP r2, r3             \n"
      "BCC FillZerobss        \n"

      "DSB                    \n"
      "POP    {R4-R11}        "
    );
}

/**
  * @brief  Initialize Processor : FPU, vector table, ...
  *         IMPORTANT ! IMPLEMENTED TO BE RUN IN SECURE STATE ONLY
  * @param  None
  * @retval None
  */
void SystemInit(void)
{
  /* Fill BSS Section with '0' */
  ZeroBss();

#if ((__FPU_PRESENT == 1) && (__FPU_USED == 1))
  /* Enable FPU */
  __FPU_Enable();
#endif

#ifdef MMU_USE
  /* Create Translation Table */
#ifdef LPAE_USE
  MMU_CreateTranslationTable_LPAE();
#else /* LPAE_USE */
  MMU_CreateTranslationTable();
#endif /* LPAE_USE */

  /* Enable MMU */
  MMU_Enable();
#endif /* MMU_USE */

