zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/system_stm32mp2xx_a35.c
#ifdef CACHE_USE
  /* Enable Caches */
  L1C_EnableCaches();
  L1C_EnableBTAC();
#endif /* CACHE_USE */

#if (__GIC_PRESENT == 1)
  uint32_t i;

  /* Initialize GIC400 and interrupts by using default CMSIS settings */
  IRQ_Initialize();

  /****************************************************************************/
  /* !!! WARNING !!!                                                          */
  /* GIC400 is used on MP2 for routing interrupts to A35 cores.               */
  /* On May 2019, CMSIS latest version 5.5.1 still doesn't support Axx cores  */
  /* based on ARMv8-A architecture, and GIC driver still support only         */
  /* one group of interrupts (No Security Extension case).                    */
  /*                                                                          */
  /* For validation reasons, in present "CMSIS Device ST STM32MP2",           */
  /* we've chosen to manage interrupts by allocating secure ones to FIQ line  */
  /* and non-secure ones to IRQ line (see #3.9.1 in [ARM IHI 0048B]).         */
  /* This means, that we have not only to configure GIC400 in a specific way, */
  /* but also to handle pending interrupts by using functions other than      */
  /* the ones available in latest "CMSIS Core_A".                             */
  /* Otherwise, we've decided to use same interrupt handler table             */
  /* (the one set within "CMSIS Core_A" for IRQ and FIQ interrupt handling.   */
  /* (see implementation of IRQ_Handler and FIQ_Handler vectors)              */
  /****************************************************************************/
  /* Tune GIC400 configuration in a specific way :                       */
  /* - Disable Priority Masking by setting GICC_PMR with a secure access */
  /*   to its highest value (see #4.4.2 in [ARM IHI 0048B])              */
#if defined(A35_NON_SECURE)
  a35ns_call_el3_monitor( CMD_WRITE_DATA, (uint32_t)&GICInterface->PMR,
                          0x000000FFUL, UNUSED_PARAM );
#else
  IRQ_SetPriorityMask(0xFFU);
#endif /* defined(A35_NON_SECURE) */

  /* - Disable Sub-Priority by setting GICC_BPR value according to       */
  /*   GIC_PRIO_BITS value (see #4.4.3 and Table 3-7 in [ARM IHI 0048B]) */
  IRQ_SetPriorityGroupBits(GIC_PRIO_BITS);

  /* On A35 secure cores,                                              */
#if !defined(A35_NON_SECURE)
  /* - Secure (aka "Group0") interrupts are routed on FIQ line,        */
  /* - Non-secure (aka "Group1") interrupts are routed on IRQ line.    */
  /*  (see #3.4 in [ARM IHI 0048B])                                    */
  /*  . by setting GICD_CTLR accordingly                               */
  /*    => "EnableGrp0" + "EnableGrp1" (see #4.3.1 in [ARM IHI 0048B]) */
  GICDistributor->CTLR = 3U;
  /*  . by setting secure GICC_CTLR (for current core) accordingly     */
  /*    => "EnableGrp0" + "EnableGrp1" + "FIQEn" + "CBPR"              */
  /*      (see #4.4.1 Table 4-31 in [ARM IHI 0048B])                   */
  GICInterface->CTLR = 0x1B;
  /* On A35 non-secure cores,                                          */
#else
  /* - Non-secure (aka "Group1") interrupts are routed on IRQ line.    */
  /*  (see #3.4 in [ARM IHI 0048B])                                    */
  /*  . by setting non-secure GICD_CTLR accordingly                    */
  /*    => "Enable" (see #4.3.1 in [ARM IHI 0048B])                    */
  GICDistributor->CTLR = 1U;
  /*  . by setting non-secure GICC_CTLR (for current core) accordingly */
  /*    => bit 0 "Enable" (see #4.4.1 Table 4-30 in [ARM IHI 0048B])   */
  GICInterface->CTLR = 1U;
#endif /* !defined(A35_NON_SECURE) */

  /* Copy table of interrupt handlers into CMSIS Core_A reference one */
  for (i = 0U; i < MAX_IRQ_n ; i++)
  {
    IRQ_SetHandler(i, Interrupt_Handlers_Table[i]);
  }
#endif
  return;
}

typedef struct
{
  uint32_t PLLSource;   /*!< The new source of the PLL.
                            This parameter can be a value of @ref RCC_PLL_Clock_Source                */
  uint8_t  PLLState;    /*!< The new state of the PLL.
                            This parameter can be a value of @ref RCC_PLL_State                       */
  uint8_t  FREFDIV;
  uint16_t FBDIV;
  uint32_t FRACIN;
  uint32_t POSTDIV1;
  uint32_t POSTDIV2;
} PLLInitTypeDef;

static void GetPLLxConfig(PLLInitTypeDef  *pll_config, uint32_t PLL_num)
{
  switch (PLL_num)
  {
    case 1:
      pll_config->PLLState = ((CA35SSC->PLL_ENABLE_RW & CA35SSC_PLL_ENABLE_RW_PLL_EN) == CA35SSC_PLL_ENABLE_RW_PLL_EN ? RCC_PLL_ON : RCC_PLL_OFF);
      pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL5_Msk) >> RCC_MUXSELCFGR_MUXSEL5_Pos;
      pll_config->FREFDIV = (CA35SSC->PLL_FREQ1_RW & CA35SSC_PLL_FREQ1_RW_REFDIV_Msk) >> CA35SSC_PLL_FREQ1_RW_REFDIV_Pos;
      pll_config->FBDIV = (CA35SSC->PLL_FREQ1_RW & CA35SSC_PLL_FREQ1_RW_FBDIV_Msk) >> CA35SSC_PLL_FREQ1_RW_FBDIV_Pos;
      pll_config->FRACIN = 0;
      pll_config->POSTDIV1 = (CA35SSC->PLL_FREQ2_RW & CA35SSC_PLL_FREQ2_RW_POSTDIV1_Msk) >> CA35SSC_PLL_FREQ2_RW_POSTDIV1_Pos;
      pll_config->POSTDIV2 = (CA35SSC->PLL_FREQ2_RW & CA35SSC_PLL_FREQ2_RW_POSTDIV2_Msk) >> CA35SSC_PLL_FREQ2_RW_POSTDIV2_Pos;
      break;
    case 4:
      pll_config->PLLState = ((RCC->PLL4CFGR1 & RCC_PLL4CFGR1_PLLEN) == RCC_PLL4CFGR1_PLLEN ? RCC_PLL_ON : RCC_PLL_OFF);
      pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos;
      pll_config->FREFDIV = (RCC->PLL4CFGR2 & RCC_PLL4CFGR2_FREFDIV_Msk) >> RCC_PLL4CFGR2_FREFDIV_Pos;
      pll_config->FBDIV = (RCC->PLL4CFGR2 & RCC_PLL4CFGR2_FBDIV_Msk) >> RCC_PLL4CFGR2_FBDIV_Pos;
      pll_config->FRACIN = (RCC->PLL4CFGR3 & RCC_PLL4CFGR3_FRACIN_Msk) >> RCC_PLL4CFGR3_FRACIN_Pos;
      pll_config->POSTDIV1 = (RCC->PLL4CFGR6 & RCC_PLL4CFGR6_POSTDIV1_Msk) >> RCC_PLL4CFGR6_POSTDIV1_Pos;
      pll_config->POSTDIV2 = (RCC->PLL4CFGR7 & RCC_PLL4CFGR7_POSTDIV2_Msk) >> RCC_PLL4CFGR7_POSTDIV2_Pos;
      break;
    case 5:
      pll_config->PLLState = ((RCC->PLL5CFGR1 & RCC_PLL5CFGR1_PLLEN) == RCC_PLL5CFGR1_PLLEN ? RCC_PLL_ON : RCC_PLL_OFF);
      pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos;
      pll_config->FREFDIV = (RCC->PLL5CFGR2 & RCC_PLL5CFGR2_FREFDIV_Msk) >> RCC_PLL5CFGR2_FREFDIV_Pos;
      pll_config->FBDIV = (RCC->PLL5CFGR2 & RCC_PLL5CFGR2_FBDIV_Msk) >> RCC_PLL5CFGR2_FBDIV_Pos;
      pll_config->FRACIN = (RCC->PLL5CFGR3 & RCC_PLL5CFGR3_FRACIN_Msk) >> RCC_PLL5CFGR3_FRACIN_Pos;
      pll_config->POSTDIV1 = (RCC->PLL5CFGR6 & RCC_PLL5CFGR6_POSTDIV1_Msk) >> RCC_PLL5CFGR6_POSTDIV1_Pos;
      pll_config->POSTDIV2 = (RCC->PLL5CFGR7 & RCC_PLL5CFGR7_POSTDIV2_Msk) >> RCC_PLL5CFGR7_POSTDIV2_Pos;
      break;
    case 6:
      pll_config->PLLState = ((RCC->PLL6CFGR1 & RCC_PLL6CFGR1_PLLEN) == RCC_PLL6CFGR1_PLLEN ? RCC_PLL_ON : RCC_PLL_OFF);
      pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos;
      pll_config->FREFDIV = (RCC->PLL6CFGR2 & RCC_PLL6CFGR2_FREFDIV_Msk) >> RCC_PLL6CFGR2_FREFDIV_Pos;
      pll_config->FBDIV = (RCC->PLL6CFGR2 & RCC_PLL6CFGR2_FBDIV_Msk) >> RCC_PLL6CFGR2_FBDIV_Pos;
      pll_config->FRACIN = (RCC->PLL6CFGR3 & RCC_PLL6CFGR3_FRACIN_Msk) >> RCC_PLL6CFGR3_FRACIN_Pos;
      pll_config->POSTDIV1 = (RCC->PLL6CFGR6 & RCC_PLL6CFGR6_POSTDIV1_Msk) >> RCC_PLL6CFGR6_POSTDIV1_Pos;
      pll_config->POSTDIV2 = (RCC->PLL6CFGR7 & RCC_PLL6CFGR7_POSTDIV2_Msk) >> RCC_PLL6CFGR7_POSTDIV2_Pos;
      break;
    case 7:
      pll_config->PLLState = ((RCC->PLL7CFGR1 & RCC_PLL7CFGR1_PLLEN) == RCC_PLL7CFGR1_PLLEN ? RCC_PLL_ON : RCC_PLL_OFF);
      pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos;
      pll_config->FREFDIV = (RCC->PLL7CFGR2 & RCC_PLL7CFGR2_FREFDIV_Msk) >> RCC_PLL7CFGR2_FREFDIV_Pos;
      pll_config->FBDIV = (RCC->PLL7CFGR2 & RCC_PLL7CFGR2_FBDIV_Msk) >> RCC_PLL7CFGR2_FBDIV_Pos;
      pll_config->FRACIN = (RCC->PLL7CFGR3 & RCC_PLL7CFGR3_FRACIN_Msk) >> RCC_PLL7CFGR3_FRACIN_Pos;
      pll_config->POSTDIV1 = (RCC->PLL7CFGR6 & RCC_PLL7CFGR6_POSTDIV1_Msk) >> RCC_PLL7CFGR6_POSTDIV1_Pos;
      pll_config->POSTDIV2 = (RCC->PLL7CFGR7 & RCC_PLL7CFGR7_POSTDIV2_Msk) >> RCC_PLL7CFGR7_POSTDIV2_Pos;
      break;
    case 8:
      pll_config->PLLState = ((RCC->PLL8CFGR1 & RCC_PLL8CFGR1_PLLEN) == RCC_PLL8CFGR1_PLLEN ? RCC_PLL_ON : RCC_PLL_OFF);
      pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos;
      pll_config->FREFDIV = (RCC->PLL8CFGR2 & RCC_PLL8CFGR2_FREFDIV_Msk) >> RCC_PLL8CFGR2_FREFDIV_Pos;
      pll_config->FBDIV = (RCC->PLL8CFGR2 & RCC_PLL8CFGR2_FBDIV_Msk) >> RCC_PLL8CFGR2_FBDIV_Pos;
      pll_config->FRACIN = (RCC->PLL8CFGR3 & RCC_PLL8CFGR3_FRACIN_Msk) >> RCC_PLL8CFGR3_FRACIN_Pos;
      pll_config->POSTDIV1 = (RCC->PLL8CFGR6 & RCC_PLL8CFGR6_POSTDIV1_Msk) >> RCC_PLL8CFGR6_POSTDIV1_Pos;
      pll_config->POSTDIV2 = (RCC->PLL8CFGR7 & RCC_PLL8CFGR7_POSTDIV2_Msk) >> RCC_PLL8CFGR7_POSTDIV2_Pos;
      break;
    default:
      pll_config->PLLState = 0;
      pll_config->PLLSource = 0;
      pll_config->FREFDIV = 0;
      pll_config->FBDIV = 0;
      pll_config->FRACIN = 0;
      pll_config->POSTDIV1 = 0;
      pll_config->POSTDIV2 = 0;
      break;
  }
}

static uint32_t ComputePLLClockFreq(PLLInitTypeDef *pll)
{
  uint32_t source_freq;
  uint64_t pll_output;

#if defined(USE_STM32MP257CXX_FPGA) || defined (USE_STM32MP215FXX_FPGA)
  source_freq = 32000000UL;
#else /* USE_STM32MP257CXX_FPGA */
  switch (pll->PLLSource)
  {
    case 0 : /* HSI */
      source_freq = HSI_VALUE;
      break;
    case 1 : /* HSE */
      source_freq = HSE_VALUE;
      break;
    case 2 : /* MSI */
      source_freq = MSI_VALUE;
      break;
    default:
      source_freq = 0;
      break;
  }
#endif /* else USE_STM32MP257CXX_FPGA || USE_STM32MP215FXX_FPGA*/

  /* Compute PLL frequency from PLL parameters according to fractional mode selection */
  /* Note : keep maximum computing precision by doubling integer resolution */
  /*        and process numerator before applying dividers */
  if (0 == pll->FRACIN)
    pll_output = (uint64_t)source_freq * (uint64_t)pll->FBDIV;
  else
  {
    pll_output = (uint64_t)source_freq * ((1<<24)*(uint64_t)pll->FBDIV + (uint64_t)pll->FRACIN);
    pll_output /= (1<<24);
  }
  pll_output /= (uint64_t)(pll->FREFDIV * pll->POSTDIV1 * pll->POSTDIV2);

  return (uint32_t)pll_output;
}

/**
  * @brief  Update SystemCoreClock variable according to Clock Register Values.
  *         The SystemCoreClock variable contains the Cortex-A35 clock.
  *         This clock can be ck_cpu1_ext2f, ck_cpu1_ext2f/2 or PLL1
  *         CAUTION: A35 SYSTICK is not based on the clock of Cortex-A35.
  *           It is based on STGEN IP which has it is own clock
  *           (ck_ker_stgen flexgen channel) based on HSI by default
  *
  * @note   Each time the Cortex-A35 clock changes, this function must be called
  *         to update SystemCoreClock variable value. Otherwise, any configuration
  *         based on this variable will be incorrect.
  *
  * @param  None
  * @retval None
  */
void SystemCoreClockUpdate(void)
{
  uint32_t        xbar_source;
  uint32_t        xbar_source_freq;
  PLLInitTypeDef  pll_config;
  uint32_t        source_clock;

