zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/system_stm32mp2xx_a35.c
  /* Check CA35 source (can be EXT2F or PLL1) */
  source_clock = CA35SSC->CHGCLKREQ_RW & CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKREQ;

  if (source_clock == 0)
  {
    /* Return PLL1 frequency */
    GetPLLxConfig(&pll_config, 1);
    SystemCoreClock = ComputePLLClockFreq(&pll_config);
  }
  else
  {
    /* Identify xbar source for ck_cpu1_ext2f flexgen channel (channel 63) */
    xbar_source = (uint32_t)(READ_BIT(RCC->XBARxCFGR[63], RCC_XBARxCFGR_XBARxSEL_Msk));

    /* Then retrieve the source frequency */
    switch (xbar_source)
    {
      case 0: /* PLL4 */
        GetPLLxConfig(&pll_config, 4);
        xbar_source_freq = ComputePLLClockFreq(&pll_config);
        break;

      case 1 : /* PLL5 */
        GetPLLxConfig(&pll_config, 5);
        xbar_source_freq = ComputePLLClockFreq(&pll_config);
        break;

      case 2 :/* PLL6 */
        GetPLLxConfig(&pll_config, 6);
        xbar_source_freq = ComputePLLClockFreq(&pll_config);
        break;

      case 3 : /* PLL7 */
        GetPLLxConfig(&pll_config, 7);
        xbar_source_freq = ComputePLLClockFreq(&pll_config);
        break;

      case 4 : /* PLL8 */
        GetPLLxConfig(&pll_config, 8);
        xbar_source_freq = ComputePLLClockFreq(&pll_config);
        break;

      case 5 : /* HSI */
      case 8 : /* HSI_KER */
        xbar_source_freq = HSI_VALUE;
        break;

      case 7 : /* MSI */
      case 10 : /* MSI_KER */
        xbar_source_freq = MSI_VALUE;
        break;

      case 6 : /* HSE */
      case 9 : /* HSE_KER */
        xbar_source_freq = HSE_VALUE;
        break;

      case 13 : /* LSI */
        xbar_source_freq = LSI_VALUE;
        break;

      case 14 : /* LSE */
        xbar_source_freq = LSE_VALUE;
        break;

      default:
        xbar_source_freq = 0;
        break;
    }

    SystemCoreClock = xbar_source_freq / (((RCC->FINDIVxCFGR[63] & RCC_FINDIVxCFGR_FINDIVx_Msk) + 1) * ((RCC->PREDIVxCFGR[63] & RCC_PREDIVxCFGR_PREDIVx_Msk) + 1));
    if ((CA35SSC->CHGCLKREQ_RW & CA35SSC_CHGCLKREQ_RW_ARM_DIVSELACK) != CA35SSC_CHGCLKREQ_RW_ARM_DIVSELACK)
    {
      SystemCoreClock /= 2;
    }
  }
}

__weak void SecurePhysicalTimer_IRQHandler_CallBack(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the SecurePhysicalTimer_IRQHandler_CallBack could be implemented in the user file
   */
}

void SecurePhysicalTimer_IRQHandler(void)
{
   /* Reload Timer according to elapsed time since IT was triggered */
   /***************************************************************************/
   /* WARNING ! Some adjustment may be needed to be more accurate on applying */
   /*           timer period value by taking into account time deviation      */
   /*           between reading CNTP_TVAL value and setting it back           */
   /*           to its computed corrected value.                              */
   /* NOTE : In DEBUG_TIMER mode, a time deviation is added to write          */
   /*        the corrected value in a readable variable.                      */
   /***************************************************************************/
#ifdef DEBUG_TIMER
   RELOAD_VAL = TimerPeriod + PL1_GetCurrentValue();
   PL1_SetLoadValue(RELOAD_VAL);
#else
   PL1_SetLoadValue(TimerPeriod + PL1_GetCurrentValue());
#endif
   /* Increment Tick value and call user CB */
   HAL_IncTick();
   SecurePhysicalTimer_IRQHandler_CallBack();
#ifdef DEBUG_PPI2x
   /* Debug mode : Increment PPI29 counter */
   PPI29_count += 1;
#endif

   return;
}

__weak void NonSecurePhysicalTimer_IRQHandler_CallBack(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the NonSecurePhysicalTimer_IRQHandler_CallBack could be implemented in the user file
   */
}

void NonSecurePhysicalTimer_IRQHandler(void)
{
   /* Reload Timer according to elapsed time since IT was triggered */
   /***************************************************************************/
   /* WARNING ! Some adjustment may be needed to be more accurate on applying */
   /*           timer period value by taking into account time deviation      */
   /*           between reading CNTP_TVAL value and setting it back           */
   /*           to its computed corrected value.                              */
   /* NOTE : In DEBUG_TIMER mode, a time deviation is added to write          */
   /*        the corrected value in a readable variable.                      */
   /***************************************************************************/
   /* WARNING ! In Aarch32, Non-secure physical timer is only reachable */
   /*           by A35 core in non-secure state. */
#ifdef DEBUG_TIMER
   RELOAD_VAL = TimerPeriod + PL1_GetCurrentValue();
   PL1_SetLoadValue(RELOAD_VAL);
#else
   PL1_SetLoadValue(TimerPeriod + PL1_GetCurrentValue());
#endif
   /* Increment Tick value and call user CB */
   HAL_IncTick();
   NonSecurePhysicalTimer_IRQHandler_CallBack();

#ifdef DEBUG_PPI2x
   /* Debug mode : Increment PPI30 counter */
   PPI30_count += 1;
#endif

   return;
}

__weak void VirtualTimer_IRQHandler_CallBack(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the VirtualTimer_IRQHandler_CallBack could be implemented in the user file
   */
}
void VirtualTimer_IRQHandler(void)
{
   /* Reload Timer according to elapsed time since IT was triggered */
   /***************************************************************************/
   /* WARNING ! Some adjustment may be needed to be more accurate on applying */
   /*           timer period value by taking into account time deviation      */
   /*           between reading CNTV_TVAL value and setting it back           */
   /*           to its computed corrected value.                              */
   /* NOTE : In DEBUG_TIMER2 mode, a time deviation is added to write         */
   /*        the corrected value in a readable variable.                      */
   /***************************************************************************/
#if (__CA_CMSIS_VERSION_MAIN>=(6U))
#ifdef DEBUG_TIMER2
   RELOAD_VAL2 = TimerPeriod + VL1_GetCurrentTimerValue();
   VL1_SetCurrentTimerValue(RELOAD_VAL2);
#else
   VL1_SetCurrentTimerValue(TimerPeriod + VL1_GetCurrentTimerValue());
#endif
#endif
   /* Increment Tick value and call user CB */
   HAL_IncTick();
   VirtualTimer_IRQHandler_CallBack();

#ifdef DEBUG_PPI2x
   /* Debug mode : Increment PPI27 counter */
   PPI27_count += 1;
#endif

   return;
}

/**
    @verbatim
    ==============================================================================
    *** How to configure SysTick, a system timestamp, equivalent to the one
    *** set by HAL CORTEX on M33 by using present SYSTEM A35 driver
    ==============================================================================
    [..]
    Setup Secure/Non-secure Physical Timer or Virtual Timer as a timebase.

