zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/system_stm32mp2xx_a35.c
    (+) The SystemA35_SYSTICK_TimerSourceConfig() function permits to select
        among different timer source to clock A35 SysTick :
        (++) Secure/Non-secure Physical Timer
        (++) Virtual Timer

   (+) The SystemA35_SYSTICK_Config() function calls the Cortex-A CMSIS
       and Device-ST CMSIS functions to :
        (++) Clock and starts the System Timestamp Generator (STGEN) (in secure mode only)
        (++) Configures the selected Timer with value passed as function parameter
        (++) Configures the selected Timer IRQ priority to the lowest value
        (++) Enables the select Timer Interrupt

   (+) You can change the selected Timer IRQ priority by calling the
       IRQ_SetPriority(SecurePhysicalTimer_IRQn, ...) or IRQ_SetPriority(NonSecurePhysicalTimer_IRQn, ...)
       or IRQ_SetPriority(VirtualTimer_IRQn, ...)
       function just after the SystemA35_SYSTICK_Config() function call.

   (+) To adjust selected Timer as a timebase, use the following formula:

       Period Value = System Timestamp Generator Clock (Hz) x Desired Timebase (s)
       (++) Period Value is the parameter to be passed to SystemA35_SYSTICK_Config() function
       (++) Period Value should not exceed 0x7FFFFFFF
  @endverbatim
  ******************************************************************************/

/**
  * @brief  xxx
  *
  * @note   xxx
  *
  * @param  xxx
  * @retval xxx
  */

/******** FUNCTIONS FOR SECURE STATE ONLY ********/

/**************************************************************/
/* WARNING ! STGENC IS ONLY ACCESSIBLE BY A35 IN SECURE STATE */
/**************************************************************/
uint32_t SystemA35_TZ_STGEN_Start( uint32_t ck_ker_clk_freq )
{
   uint32_t reg_val;

   /* CHECK SECURE STATE : NOT IMPLEMENTED YET ! */

   /* Start Timestamp generator */
   /* (clock source of A35 secure/non-secure physical timers) */
   /* - if it has not been done already, enable STGENRW/STGENRO clock */
   /*   by setting RCC_STGENCFGR bit 1 "STGENEN" */
   if ((RCC->STGENCFGR & 0x2) != 0x2)
   {
      reg_val = RCC->STGENCFGR | 0x2;
      RCC->STGENCFGR = reg_val;
   }

   /* Set STGEN frequency value in dedicated register */
   STGENC->CNTFID0 = ck_ker_clk_freq;

   /* Set DBGMCU_CRA35 to halt timestamp generation on debug */
   /* by setting its bit 1 "DBG_STGEN_STOP" */
   DBGMCU->CRA35 |= DBGMCU_CRA35_DBG_STGEN_STOP;

   /* - if it has not been done already, start STGENC */
   /*   by setting CNTCR bit 0 "EN" */
   /*   and bit 1 "HDBG" (to halt timestamp generation on debug) */
   if ((STGENC->CNTCR & 0x3) != 0x3)
   {
      reg_val = STGENC->CNTCR | 0x3;
      STGENC->CNTCR = reg_val;
   }
   return 0;
}

uint32_t SystemA35_TriggerInterruptAtGICInput( gic_interrupt_config_t interrupt_config )
{
   uint32_t gicd_regval, line;
   uint32_t gicd_reg_idx;

   /* Force interrupt by software action at GIC400 input according to interrupt index : */
   line = interrupt_config.it_idx;
   /* . SGI case : */
   if (line <= SGI15_IRQn)
   {
      /* Set GICD_SGIR (see #4.3.15 in [ARM IHI 0048B]) according to : */
      /* - selected interrupt index */
      gicd_regval = line & 0xF;
      /* - selected CPU target list */
      /*   by setting "TargetListFilter" bits [25:24] to 0b00      */
      /*   and by setting "CPUTargetList" bits [23:16] accordingly */
      gicd_regval |= (interrupt_config.it_a35_targets & 0xFFUL) << 16U;
      /* - selected security mode */
      /*   NB : In CMSIS v5.5.1, "CMSIS Core_A" functions GIC_SendSGI()         */
      /*        and GIC_SetPendingIRQ() don't take into account security mode ! */
      /* - in non-secure case, */
      if (A35_IT_NON_SECURE == interrupt_config.it_security_mode)
      {
      /*   set GICD_SGIR "NSATT" bit 15 set to 1  */
         gicd_regval |= 0x1 << 15;
      }
      /* - in secure case, set GICD_SGIR "NSATT" bit 15 set (let) to 0 */
      /* Send SGI by writing GICD_SGIR register */
      GICDistributor->SGIR = gicd_regval;
      /* Complete SGI sending by writing GICD_SPENDSGIRn register ? */
      /* (see #4.3.17 in [ARM IHI 0048B]) */
      /* TO BE IMPLEMENTED ? */
   }
   /* . PPI and SPI cases : */
   /*   Set GICD_ISPENDRn register (see #4.3.7 in [ARM IHI 0048B]) */
   else if (line < MAX_IRQ_n)
   {
       /* According to selected interrupt index by : */
       /* - computing GICD_ISPENDRn register index   */
       gicd_reg_idx = line >> 5;
       /* - computing GICD_ISPENDRn register value   */
       gicd_regval = 1 << (line & 0x1f);
       /* Send PPI/SPI by writing GICD_ISPENDRn register */
       GICDistributor->ISPENDR[gicd_reg_idx] = gicd_regval;
   }
   return 0;
}

/* Retrieve A35 secure state by reading registers GICC_ABPR */
/* (see #4.4.8 in [ARM IHI 0048B])                          */
uint32_t SystemA35_IsA35InSecureState( void )
{
   uint32_t secure_flag = 0xDEADBEEF;

   if (0 == GICInterface->ABPR)
   {
       secure_flag = 0;
   }
   else
   {
       secure_flag = 1;
   }
   return secure_flag;
}

uint32_t SystemA35_RouteInterrupt( gic_interrupt_config_t interrupt_config )
{
   uint32_t gicd_priority_val, priority_left_shifting = 0;
   uint32_t mode_config_for_gicd_settings;
   uint32_t f_status = 0;

   /* Check input parameters [TO BE DONE] to set output status */
   /* - it_idx           : interrupt index in range [0;Max_IRQn] */
   /* - it_priority      : interrupt priority in range [0;(1<<(GIC_PRIO_BITS-1))-1] */
   /*                      A shift of one-bit left will be applied in non-secure interrupt case */
   /* - it_trigger_mode  : interrupt trigger mode check done by IRQ_SetMode function */
   /* - it_security_mode : interrupt security mode among {A35_IT_SECURE; A35_IT_NON_SECURE} */
   /* - it_a35_targets   : A35 CPU target among {IT_TARGETS_A35_0; IT_TARGETS_A35_1; IT_TARGETS_A35_X} */

   /* Disable selected interrupt */
   IRQ_Disable(interrupt_config.it_idx);
   /* Clear pending selected interrupt */
   IRQ_ClearPending(interrupt_config.it_idx);

   /* Set interrupt request mode */
   /* according to selected trigger mode, security mode and A35 CPU target */
   /* and by setting interrupt type to IRQ_MODE_TYPE_IRQ (to pass IRQ_SetMode checks) */
   /* - IRQ_MODE_TRIG bits[2:0] */
   mode_config_for_gicd_settings = interrupt_config.it_trigger_mode & IRQ_MODE_TRIG_Msk;
   /* - IRQ_MODE_TYPE bit 3 */
   mode_config_for_gicd_settings &= ~IRQ_MODE_TYPE_Msk;
   mode_config_for_gicd_settings |= IRQ_MODE_TYPE_IRQ;
   /* - IRQ_MODE_DOMAIN bit 4 */
   mode_config_for_gicd_settings &= ~IRQ_MODE_DOMAIN_Msk;
   if (A35_IT_SECURE == interrupt_config.it_security_mode)
   {
      mode_config_for_gicd_settings |= IRQ_MODE_DOMAIN_SECURE;
      priority_left_shifting = 0;
   }
   else
   {
      mode_config_for_gicd_settings |= IRQ_MODE_DOMAIN_NONSECURE;
      priority_left_shifting = 1;
   }
   /* - IRQ_MODE_CPU bits [12:5] */
   mode_config_for_gicd_settings &= ~IRQ_MODE_CPU_Msk;
   if (IT_TARGETS_A35_0 == interrupt_config.it_a35_targets)
   {
      mode_config_for_gicd_settings |= IRQ_MODE_CPU_0;
   }
   else if (IT_TARGETS_A35_1 == interrupt_config.it_a35_targets)
   {
      mode_config_for_gicd_settings |= IRQ_MODE_CPU_1;
   }
   else
   {
      mode_config_for_gicd_settings |= (IRQ_MODE_CPU_0 | IRQ_MODE_CPU_1);
   }
   IRQ_SetMode(interrupt_config.it_idx, mode_config_for_gicd_settings);
#ifdef WA_CMSIS_ISSUE_IRQ_SETMODE
   /* Fix incorrect setting of register GICD_IGROUPn for current interrupt */
   FIX_SetModeIssueOnInterruptGroup(interrupt_config.it_idx, mode_config_for_gicd_settings);
#endif /* WA_CMSIS_ISSUE_IRQ_SETMODE */

