zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/system_stm32mp2xx_a35.c
   /* Set GICD priority of selected interrupt */
   /* according to input value, GIC_PRIO_BITS value and security mode */
   /* Apply "Non-cooperative" scheme for managing interrupt priority */
   /* (see #3.6.3 [ARM IHI 0048B]) */
   gicd_priority_val = interrupt_config.it_priority << (8U - GIC_PRIO_BITS);
   gicd_priority_val = gicd_priority_val << priority_left_shifting;
   IRQ_SetPriority(interrupt_config.it_idx, gicd_priority_val);

   /* Enable selected interrupt */
   IRQ_Enable(interrupt_config.it_idx);

   return f_status;
}

/* Unroute ... */
/* Managing called functions returned status : TO BE DONE LATER */
uint32_t SystemA35_UnrouteInterrupt( uint32_t interrupt_index )
{
   uint32_t gicd_priority_val;
   uint32_t mode_config_for_gicd_settings;
   uint32_t f_status = 0;

   /* Check input parameters [TO BE DONE] to set output status   */
   /* - it_idx           : interrupt index in range [0;Max_IRQn] */

   /* Disable selected interrupt */
   IRQ_Disable(interrupt_index);

   /* Reset interrupt request mode (defined in "CMSIS CORE_A")  */
   /* to default trigger mode, security mode and A35 CPU target */
   /* and by setting interrupt type to IRQ_MODE_TYPE_IRQ */
   /* (to pass IRQ_SetMode checks). */
   /* - IRQ_MODE_TRIG bits[2:0] reset to IRQ_MODE_TRIG_EDGE */
   mode_config_for_gicd_settings = IRQ_MODE_TRIG_EDGE;
   /* - IRQ_MODE_TYPE bit 3 set to IRQ_MODE_TYPE_IRQ */
   mode_config_for_gicd_settings &= ~IRQ_MODE_TYPE_Msk;
   mode_config_for_gicd_settings |= IRQ_MODE_TYPE_IRQ;
   /* - IRQ_MODE_DOMAIN bit 4 reset to IRQ_MODE_DOMAIN_SECURE */
   mode_config_for_gicd_settings &= ~IRQ_MODE_DOMAIN_Msk;
   mode_config_for_gicd_settings |= IRQ_MODE_DOMAIN_SECURE;
   /* - IRQ_MODE_CPU bits [12:5] reset to 0x00 (no CPU target) */
   mode_config_for_gicd_settings &= ~IRQ_MODE_CPU_Msk;
   IRQ_SetMode(interrupt_index, mode_config_for_gicd_settings);
#ifdef WA_CMSIS_ISSUE_IRQ_SETMODE
   /* Fix incorrect setting of register GICD_IGROUPn for current interrupt */
   FIX_SetModeIssueOnInterruptGroup(interrupt_index, mode_config_for_gicd_settings);
#endif /* WA_CMSIS_ISSUE_IRQ_SETMODE */
   /* Set GICD priority of disabled interrupt to (secure) lowest priority */
   /* according to GIC_PRIO_BITS value */
   gicd_priority_val = ((1<<(GIC_PRIO_BITS-1))-1) << (8U - GIC_PRIO_BITS);
   IRQ_SetPriority(interrupt_index, gicd_priority_val);

   return f_status;
}

/**
  * @brief  xxx
  *
  * @note   xxx
  *
  * @param  xxx
  * @retval xxx
  */

uint32_t SystemA35_SYSTICK_Config( uint32_t timer_priority )
{
   uint32_t gicd_priority_val, ref_freq_val = 0;
   IRQn_Type sourcetimer_irq;

   /* Stop Timers */
   PL1_SetControl(0x0);
#if (__CA_CMSIS_VERSION_MAIN>=(6U))
   VL1_SetControl(0x0);
#endif
   /* Reset Timers */
   PL1_SetLoadValue(0);
   PL1_SetPhysicalCompareValue(0);
#if (__CA_CMSIS_VERSION_MAIN>=(6U))
   VL1_SetCurrentTimerValue(0);
   VL1_SetTimerCompareValue(0);
#endif

#ifdef DEBUG_PPI2x
   FIQ_count = 0;
   IRQ_count = 0;
#endif

   /* Set Counter Frequency according to frequency of STGEN source clock */
#if defined(A35_NON_SECURE)
   ref_freq_val
      = a35ns_call_el3_monitor( CMD_READ_DATA, (uint32_t)&STGENC->CNTFID0,
                                UNUSED_PARAM, UNUSED_PARAM );
#else
   ref_freq_val = STGENC->CNTFID0;
#endif /* defined(A35_NON_SECURE) */
   if (__get_CNTFRQ() != ref_freq_val)
   {
      PL1_SetCounterFrequency(ref_freq_val);
   }
   /* Initialize Timer to get a 1ms-period */
   TimerPeriod = ref_freq_val / 1000;
   if (A35_SYSTICK_PHYSICALTIMERSOURCE == A35SysTick_TimerSource)
   {
      /* Secure vs non-secure Physical Timer case */
      /* according to Aarch32 Exception level */
      if (1 == g_isAarch32inEL3_flag)
      {
         sourcetimer_irq = SecurePhysicalTimer_IRQn;
      }
      else
      {
         sourcetimer_irq = NonSecurePhysicalTimer_IRQn;
      }
   }
   else
   {
      sourcetimer_irq = VirtualTimer_IRQn;
   }
   /* Disable corresponding IRQ */
   IRQ_Disable(sourcetimer_irq);
   IRQ_ClearPending(sourcetimer_irq);

   /* Set timer priority according to input value and GIC_PRIO_BITS value */
   gicd_priority_val = timer_priority << (8U - GIC_PRIO_BITS);
   IRQ_SetPriority(sourcetimer_irq, gicd_priority_val);

   /* Set IRQ to level-triggered mode */
   IRQ_SetMode(sourcetimer_irq, IRQ_MODE_TRIG_LEVEL);

   /* Enable corresponding interrupt */
   IRQ_Enable(sourcetimer_irq);

   /* Start and Load Timer */
   if (A35_SYSTICK_PHYSICALTIMERSOURCE == A35SysTick_TimerSource)
   {
      PL1_SetLoadValue(TimerPeriod);
      PL1_SetControl(0x1);
   }
   else
   {
#if(__CA_CMSIS_VERSION_MAIN>=(6U))
      VL1_SetCurrentTimerValue(TimerPeriod);
      VL1_SetControl(0x1);
#endif
   }
   return 0;
}

uint32_t SystemA35_ManageTick( uint32_t suspend_resume_stop_tick )
{
   IRQn_Type sourcetimer_irq;
   uint32_t status = 1, tick;

   switch(A35SysTick_TimerSource)
   {
      case A35_SYSTICK_VIRTUALTIMERSOURCE :
         sourcetimer_irq = VirtualTimer_IRQn;
         break;

      case A35_SYSTICK_PHYSICALTIMERSOURCE :
      default :
         /* Secure vs non-secure Physical Timer case */
         /* according to Aarch32 Exception level */
         if (1 == g_isAarch32inEL3_flag)
         {
            sourcetimer_irq = SecurePhysicalTimer_IRQn;
         }
         else
         {
            sourcetimer_irq = NonSecurePhysicalTimer_IRQn;
         }
         break;
   }
   /* Process input command for current SysTick source */
   switch(suspend_resume_stop_tick)
   {
      case A35_RESUME_SYSTICK :
#ifdef DEBUG_PPI2x
         printf("<D> PPI27/PPI29/PPI30 counts = %ld / %ld / %ld vs Tick count = %ld vs FIQ/IRQ counts = %ld / %ld\n",
                PPI27_count, PPI29_count, PPI30_count, HAL_GetTick(), FIQ_count, IRQ_count );
#endif
         tick = HAL_GetTick();
         /* Enable corresponding interrupt */
         IRQ_Enable(sourcetimer_irq);
         /* Check & retime tick occurrence by waiting tick value to be modified */
         while (tick == HAL_GetTick()){};
         status = 0;
         break;

      case A35_STOP_SYSTICK :
         /* Stop Timers */
         PL1_SetControl(0x0);
#if (__CA_CMSIS_VERSION_MAIN>=(6U))
         VL1_SetControl(0x0);
#endif
      case A35_SUSPEND_SYSTICK :
         /* Disable corresponding interrupt and clear it if pending */
         IRQ_Disable(sourcetimer_irq);
         IRQ_ClearPending(sourcetimer_irq);
#ifdef DEBUG_PPI2x
         printf("<D> PPI27/PPI29/PPI30 counts = %ld / %ld / %ld vs Tick count = %ld vs FIQ/IRQ counts = %ld / %ld\n",
                PPI27_count, PPI29_count, PPI30_count, HAL_GetTick(), FIQ_count, IRQ_count );
#endif
         status = 0;
         break;

      default :
         break;
   }
   return status;
}

uint32_t SystemA35_SYSTICK_TimerSourceConfig( uint32_t timer_source )
{
   switch(timer_source)
   {
      case A35_SYSTICK_VIRTUALTIMERSOURCE :
         A35SysTick_TimerSource = A35_SYSTICK_VIRTUALTIMERSOURCE;
         break;

      case A35_SYSTICK_PHYSICALTIMERSOURCE :
      default :
         A35SysTick_TimerSource = A35_SYSTICK_PHYSICALTIMERSOURCE;
         break;
   }
   return 0;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
